RIET/src/Reports/ageing/ageing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ageing</name>
  <attributes>
    <name>ОбщийОтчет</name>
    <type>
      <types>ReportObject.ОтчетСписокКроссТаблица</types>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/AccumulationRegisters/ВзаиморасчетыСПокупателями/ВзаиморасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСПокупателями</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОтчетАгентаПоРасходам</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
      <types>DocumentRef.ОтчетПринципалуОПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетНаПредоплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>WO</name>
    <type>
      <types>CatalogRef.ЗаказНаряды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/СчетНаОплатуПокупателю/СчетНаОплатуПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплатуПокупателю</name>
  <comment>(Общ)</comment>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.СчетаНаПредоплату</registerRecords>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ) Курс валюты взаиморасчетов по договору</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейНаОплату</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬРеализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Well</name>
      <type>
        <types>CatalogRef.Wells</types>
      </type>
    </attributes>
    <attributes>
      <name>Oilfield</name>
      <type>
        <types>CatalogRef.Oilfields</types>
      </type>
    </attributes>
    <attributes>
      <name>WO</name>
      <type>
        <types>CatalogRef.ЗаказНаряды</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SIR</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ticket</name>
      <type>
        <types>DocumentRef.Tickets</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратнаяТара</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ) Оценочная стоимость возвратной тары в валюте взаиморасчетов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Содержание</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Well</name>
      <type>
        <types>CatalogRef.Wells</types>
      </type>
    </attributes>
    <attributes>
      <name>Oilfield</name>
      <type>
        <types>CatalogRef.Oilfields</types>
      </type>
    </attributes>
    <attributes>
      <name>WO</name>
      <type>
        <types>CatalogRef.ЗаказНаряды</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеEng</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SIR</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ticket</name>
      <type>
        <types>DocumentRef.Tickets</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Reports/ageing/ObjectModule.bsl
#Если Клиент Тогда
	
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаНач", ОбщийОтчет.ДатаНач);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаКон", ОбщийОтчет.ДатаКон);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ТекущаяДата", ОбщийОтчет.ДатаКон);

	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	СчетНаОплатуПокупателю.Ссылка КАК СчетНаОплату,
	        |	СчетФактураВыданный.Ссылка КАК СчетФактура,
	        |	ВЫБОР
	        |		КОГДА ДЕНЬГОДА(&ТекущаяДата) + (ГОД(&ТекущаяДата) - ГОД(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата)) * 365 - ДЕНЬГОДА(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата) МЕЖДУ 0 И 30
	        |			ТОГДА "" 1-30""
	        |		КОГДА ДЕНЬГОДА(&ТекущаяДата) + (ГОД(&ТекущаяДата) - ГОД(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата)) * 365 - ДЕНЬГОДА(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата) МЕЖДУ 31 И 60
	        |			ТОГДА "" 31-60""
	        |		КОГДА ДЕНЬГОДА(&ТекущаяДата) + (ГОД(&ТекущаяДата) - ГОД(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата)) * 365 - ДЕНЬГОДА(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата) МЕЖДУ 61 И 90
	        |			ТОГДА "" 61-90""
	        |		КОГДА ДЕНЬГОДА(&ТекущаяДата) + (ГОД(&ТекущаяДата) - ГОД(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата)) * 365 - ДЕНЬГОДА(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата) МЕЖДУ 91 И 120
	        |			ТОГДА "" 91-120""
	        |		КОГДА ДЕНЬГОДА(&ТекущаяДата) + (ГОД(&ТекущаяДата) - ГОД(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата)) * 365 - ДЕНЬГОДА(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата) МЕЖДУ 121 И 180
	        |			ТОГДА ""121-180""
	        |		КОГДА ДЕНЬГОДА(&ТекущаяДата) + (ГОД(&ТекущаяДата) - ГОД(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата)) * 365 - ДЕНЬГОДА(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата) МЕЖДУ 181 И 360
	        |			ТОГДА ""181-360""
	        |		КОГДА ДЕНЬГОДА(&ТекущаяДата) + (ГОД(&ТекущаяДата) - ГОД(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата)) * 365 - ДЕНЬГОДА(ВзаиморасчетыСПокупателямиОстатки.Сделка.Дата) > 360
	        |			ТОГДА ""360+""
	        |	КОНЕЦ КАК Период,
	        |	ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	        |	ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	        |	ВзаиморасчетыСПокупателямиОстатки.ПодразделениеОрганизации КАК Подразделение,
	        |	ВзаиморасчетыСПокупателямиОстатки.Сделка КАК Сделка,
	        |	ВзаиморасчетыСПокупателямиОстатки.КостЦентр КАК КостЦентр,
	        |	ВзаиморасчетыСПокупателямиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	        |	ВзаиморасчетыСПокупателямиОстатки.СуммаУпрОстаток КАК СуммаUSD,
	        |	ВзаиморасчетыСПокупателямиОстатки.СуммаРеглОстаток КАК СуммаРуб,
	        |	ВзаиморасчетыСПокупателямиОстатки.ИнвойсинговыйЦентр
	        |{ВЫБРАТЬ
	        |	СчетНаОплату.*,
	        |	СчетФактура.*,
	        |	Период,
	        |	ДоговорКонтрагента.*,
	        |	Контрагент.*,
	        |	Подразделение.*,
	        |	Сделка.*,
	        |	КостЦентр.*,
	        |	ИнвойсинговыйЦентр.*}
	        |ИЗ
	        |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(&ДатаКон, ) КАК ВзаиморасчетыСПокупателямиОстатки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	        |		ПО ВзаиморасчетыСПокупателямиОстатки.Сделка = СчетФактураВыданный.ДокументОснование
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	        |		ПО ВзаиморасчетыСПокупателямиОстатки.Сделка = СчетНаОплатуПокупателю.ДокументОснование
	        |ГДЕ
	        |	ВзаиморасчетыСПокупателямиОстатки.Сделка <> НЕОПРЕДЕЛЕНО
	        |{ГДЕ
	        |	СчетНаОплатуПокупателю.Ссылка.* КАК СчетНаОплату,
	        |	СчетФактураВыданный.Ссылка.* КАК СчетФактура,
	        |	ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента.*,
	        |	ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента.Владелец.* КАК Контрагент,
	        |	ВзаиморасчетыСПокупателямиОстатки.ПодразделениеОрганизации.* КАК Подразделение,
	        |	ВзаиморасчетыСПокупателямиОстатки.Сделка.*,
	        |	ВзаиморасчетыСПокупателямиОстатки.КостЦентр.*,
	        |	ВзаиморасчетыСПокупателямиОстатки.ИнвойсинговыйЦентр.*}
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Период
	        |{УПОРЯДОЧИТЬ ПО
	        |	СчетНаОплату.*,
	        |	СчетФактура.*,
	        |	Период,
	        |	ДоговорКонтрагента.*,
	        |	Контрагент.*,
	        |	Сделка.*,
	        |	Подразделение.*,
	        |	КостЦентр.*,
	        |	ИнвойсинговыйЦентр.*}
	        |ИТОГИ
	        |	СУММА(СуммаВзаиморасчетов),
	        |	СУММА(СуммаUSD),
	        |	СУММА(СуммаРуб)
	        |ПО
	        |	ОБЩИЕ
	        |{ИТОГИ ПО
	        |	Период,
	        |	СчетНаОплату.*,
	        |	СчетФактура.*,
	        |	ДоговорКонтрагента.*,
	        |	Контрагент.*,
	        |	Подразделение.*,
	        |	Сделка.*,
	        |	КостЦентр.*,
	        |	ИнвойсинговыйЦентр.*}";	
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "КостЦентр", "Accounting unit");
	СтруктураПредставлениеПолей.Вставить( "Сделка", "Документ");
    СтруктураПредставлениеПолей.Вставить( "ДоговорКонтрагента", "Договор контрагента");
	СтруктураПредставлениеПолей.Вставить( "СчетФактура", "Счет фактура");
	СтруктураПредставлениеПолей.Вставить( "СчетНаОплату", "Счет на оплату");
    СтруктураПредставлениеПолей.Вставить( "ИнвойсинговыйЦентр", "Инвойсинговый центр");

	
	ПостроительОтчета.Текст = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаВзаиморасчетов",   "Сумма (в валюте)",    Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаРуб",   "Сумма (в рублях)",    Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаUSD",   "Сумма (в валюте USD)",    Истина, "ЧЦ=15; ЧДЦ=2");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Контрагент");
	МассивОтбора.Добавить("СчетНаОплату");
	МассивОтбора.Добавить("СчетФактура");
	МассивОтбора.Добавить("ДоговорКонтрагента");
	МассивОтбора.Добавить("КостЦентр");
	МассивОтбора.Добавить("Подразделение");
	МассивОтбора.Добавить("ИнвойсинговыйЦентр");

	ПостроительОтчета.ИзмеренияСтроки.Добавить("Контрагент");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("ДоговорКонтрагента");
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Период");

	
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	ПостроительОтчета.ВыбранныеПоля.Добавить("Сделка");
	ПостроительОтчета.ВыбранныеПоля.Добавить("Подразделение");

	
	ОбщийОтчет.ВыводитьПоказателиВСтроку=Истина;
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);
		
	ИначеЕсли ТипЗнч(РасшифровкаСтроки) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		СтандартнаяОбработка = Ложь;
		ФормаРегистра = РегистрыНакопления.ВзаиморасчетыСПокупателями.ПолучитьФормуСписка();
		ФормаРегистра.РегистрНакопленияСписок.Отбор.Сделка.Значение = РасшифровкаСтроки.ДокументОснование;
        ФормаРегистра.РегистрНакопленияСписок.Отбор.Сделка.Использование = Истина;
        ФормаРегистра.РегистрНакопленияСписок.Отбор.Сделка.ВидСравнения = ВидСравнения.Равно;
		ФормаРегистра.Открыть();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Добавляет в структуру общие для всех отчетов параметры настройки
//
// Параметры:
//	Нет.
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкиПостроителя", ОбщийОтчет.ПостроительОтчета.ПолучитьНастройки());
	СтруктураНастроек.Вставить("Показатели", ОбщийОтчет.Показатели.Выгрузить());
	СтруктураНастроек.Вставить("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураНастроек.Вставить("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураНастроек.Вставить("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураНастроек.Вставить("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураНастроек.Вставить("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьСтруктуруДляСохраненияНастроек()()

// Заполняет из структуры настроек общие параметры отчетов
//
// Параметры:
//	Нет.
//
Процедура ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ПоказыватьЗаголовок) Экспорт
	Перем ТабПоказатели;
	
	Если ТипЗнч(ОбщийОтчет.СохраненныеНастройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.УстановитьНастройки(СтруктураСНастройками.НастройкиПостроителя);
	
	СтруктураСНастройками.Свойство("Показатели", ТабПоказатели);
	Если ТипЗнч(ТабПоказатели) = Тип("ТаблицаЗначений") Тогда
		ОбщийОтчет.Показатели.Загрузить(ТабПоказатели);
	КонецЕсли;
	
	СтруктураСНастройками.Свойство("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураСНастройками.Свойство("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураСНастройками.Свойство("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураСНастройками.Свойство("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураСНастройками.Свойство("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
КонецПроцедуры // ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки)()

ОбщийОтчет.ИмяРегистра          = "ВзаиморасчетыСПокупателями";
ОбщийОтчет.мНазваниеОтчета      = "Отчет ";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода   = 1;

#КонецЕсли
